{"query": "Instruct: Given a query, retrieve documents that answer the query. \n Query: who is the author of the lost lemon mine", "pos": ["Lost Lemon Mine The Lost Lemon Mine is a legendary lost mine said to be located in the Canadian province of Alberta. The story has been retold in countless books with the authoritative version being \"The Lost Lemon Mine\" by Tom Primrose. The story first appeared in the 1946 edition of the \"Alberta Folklore Quarterly\" and later in magazines such as \"Canada West\". The Lost Lemon Mine has also been featured in the television documentary series \"Northern Mysteries\" and worked into the plot of \"The Final Sacrifice\". Countless people have searched for the mine. A number of searchers have never"], "neg": ["Chasnala mining disaster The Chasnala mining disaster was a disaster that happened on 27 December 1975 in a coal mine in Chasnala near Dhanbad in the Indian state of Jharkhand. An explosion in the mine followed by killed 372 miners. When a roof of coal caved in, of water per minute flooded into the mine. The miners were trapped under a mountain of debris and drowned when the water surged into the mine. The Indian Iron and Steel Company (IISCO), which owned the mine, said it conformed to international standards. The film Kaala Patthar depicts the tragedy. Shaheed Smarak was", "Churchyard in Portchester. James Lind's is one of twenty-three names to feature on the Frieze of the London School of Hygiene and Tropical Medicine building in Keppel Street, London. Names were selected by a committee of unknown constitution who chose those who were deemed to be pioneers in public health and tropical medicine. James Lind James Lind (4 October 1716 – 13 July 1794) was a Scottish doctor. He was a pioneer of naval hygiene in the Royal Navy. By conducting one of the first ever clinical trials, he developed the theory that citrus fruits cured scurvy. He argued for", "Little Miss Nobody case remains unsolved. This unidentified decedent became known as \"Little Miss Nobody\" after no family or friends came forward to either report her missing, or to claim her body. Following recent advances in technology, a forensic facial reconstruction of \"Little Miss Nobody\" was released to the media in 2018 in renewed efforts to identify this unidentified child murder victim's remains. The partially buried body of a female child was found in Sand Wash Creek Bed on Old Alamo Road in Congress, Arizona on July 31, 1960. Her body was discovered by a Las Vegas schoolteacher named Russell Allen, who had been", "Kerr. The book was a minor success, earning Haggard a profit of fifty pounds. Haggard later named his daughter Dorothy after the heroine in the novel. The Witch's Head The Witch's Head is the second novel by H. Rider Haggard, which he wrote just prior to \"King Solomon's Mines\". Haggard wrote the novel following his debut effort \"Dawn\". He was unable to find any magazine that would serialise the story, but it was accepted for publication by the firm that had put out \"Dawn\". Haggard later wrote that \"although, except for the African part, it is not in my opinion", "Mountain (TV series) includes a succession of hairpin bends and a 1 in 3 gradient, rising to in little over a mile, and Rhys Jones travels it riding pillion on a motorcycle. He then visits Honister Slate Mine, near Keswick. The stone circle at Swinside serves to illustrate the mysticism of the Lakes, and Rhys Jones attends a meeting of Quakers, whose founder, George Fox, preached from an outcrop on Firbank Fell. The presenter then follows Samuel Taylor Coleridge's perilous descent of Broad Stand, a series of sloping steps on Sca Fell. After discovering how the climber's fuel of choice, Kendal mint cake,", "And the Ass Saw the Angel And the Ass Saw the Angel is the first novel by the Australian musician and singer Nick Cave, originally published in 1989 by Black Spring Press in the United Kingdom and Harper Collins in the United States. It was re-published in 2003 by 2.13.61. A luxury \"collector's edition\" was released, in the summer of 2007, by Black Spring Press. The title is a biblical quotation from the Book of Numbers, Chapter 22, Verses 23-31: \"And the ass saw the angel of the Lord standing in the way, ...\". With its Southern Gothic setting, critics", "John Williamson (geologist) 1967. The book depicts Williamson as quiet to the point of secretive, and something of a womanizer. However, it also hails him as the last of the great diamond prospectors, who were able to find meaningful deposits and establish significant, successful mines without outside resources or support. While the book is known to have taken some liberties with the facts, it is one of the few biographical sources available. John Gunther in \"Inside Africa\" gives an account of a visit to the mine, describing Williamson as (partly on account of ill health) \"an almost total recluse\" whose one hobby was"]}